# Home work 29 December 2021.
# a,b = (input().split())
# a = int(a)
# b = int(b)
# if a == b:
#     print( (a + b) * 2)
# else:
#     print( a + b)

# Class work 29 December 2021.
# winners = input().split()
# winners = list(map(int, winners))
# print (winners)

# Class work 13 praktika Januar 5 2022
# nums = input().split()
# nums = list(map(int, nums))
# summary = 0
# for element in mus:
#     summary = summary + element
# print("Otvet: ", -summary)

# Вводим неизвестное кличество чисел, затем отнимаем их друг от друга
# nums = input().split()
# nums = list(map(int, nums))
# summary = nums[0]
# for element in nums:
#     summary = summary - element
#     x = summary + nums[0]
# print("Otvet: ", x)

# тоже самое только другим методом, используем срез
# nums = input().split()
# nums = list(map(int, nums))
# summary = nums[0]
# for element in nums[1:]:
#     summary = summary - element
# print("Otvet: ", summary)

# Ввод пароля два раза.
# word = "code"
# i = 0
# while i < 2:
#     a =input("Enter a password: ")
#     if a == word:
#         print("Password is correct")
#     else:
#         print("Please, enter password again")
#         i = i + 1
#     break


# for elem in "Hiiya":
#     if elem == "i":
#         continue
#     print(elem, end = ", ")


# Создайте словарь (или json файл) student, с информацией о себе.
# К примеру: имя, хобби, любимые фильмы, или жанры музыки. Минимум 4 пары ключей-значений.
# Подсказка: В коде урока 15, есть словарь для примера.
# student = {"name" : "Aman", "hobbies": "football", "film" : "tor", "music" : "rock"
#         }
# print(student["music"])

